<h3> Selection & drop </h3>

<h4>Selection with column names </h4>

* 한 개의 column 선택시 column의 label을 넘겨준다.<br>
df["account"].head(3)
* 1개 이상의 column 선택시 column을 모아둔 list를 넘긴다. <br>
df[["account", "street", "state"]].head(3)

In [1]:
import pandas as pd
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
            'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
            'age': [42, 52, 36, 24, 73],
            'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boson']}

df = pd.DataFrame(raw_data)

In [2]:
df["age"].head(3)

0    42
1    52
2    36
Name: age, dtype: int64

In [3]:
df[["age", "first_name", "last_name"]]

   age first_name last_name
0   42      Jason    Miller
1   52      Molly  Jacobson
2   36       Tina       Ali
3   24       Jake    Milner
4   73        Amy     Cooze

<h4> Selection with index number </h4>

column 이름 없이 사용하는 index number는 row를 기준으로 표시한다.

In [4]:
df[:3]

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami

인덱스를 숫자가 아닌 문자로 바꿔도 동일한 결과가 나온다.

In [8]:
index_list = ['a', 'b', 'c', 1, 2]
df.index = index_list
df

  first_name last_name  age           city
a      Jason    Miller   42  San Francisco
b      Molly  Jacobson   52      Baltimore
c       Tina       Ali   36          Miami
1       Jake    Milner   24        Douglas
2        Amy     Cooze   73          Boson

In [9]:
df[:3]

  first_name last_name  age           city
a      Jason    Miller   42  San Francisco
b      Molly  Jacobson   52      Baltimore
c       Tina       Ali   36          Miami

In [10]:
df[:'b']

  first_name last_name  age           city
a      Jason    Miller   42  San Francisco
b      Molly  Jacobson   52      Baltimore

column의 이름과 함께 row index를 사용하면 해당 column만 series로 변환한다.

In [11]:
df['first_name'][:3]

a    Jason
b    Molly
c     Tina
Name: first_name, dtype: object

아래처럼 시리즈로 바꿔서 원소를 추출해볼 수 있다.

In [14]:
age_series = df['age']
age_series[:3]

a    42
b    52
c    36
Name: age, dtype: int64

In [17]:
age_series[[1, 2, 'a']]

1    24
2    73
a    42
Name: age, dtype: int64

In [20]:
age_series[age_series < 40]

c    36
1    24
Name: age, dtype: int64

<h4> index 변경 </h4>

In [23]:
import pandas as pd
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
            'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
            'age': [42, 52, 36, 24, 73],
            'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boson']}

df = pd.DataFrame(raw_data)
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73          Boson

In [24]:
df.index = df.first_name
df.drop('first_name', axis=1)

           last_name  age           city
first_name
Jason         Miller   42  San Francisco
Molly       Jacobson   52      Baltimore
Tina             Ali   36          Miami
Jake          Milner   24        Douglas
Amy            Cooze   73          Boson

<h4> basic, loc, iloc selection </h4>

In [28]:
import pandas as pd
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
            'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
            'age': [42, 52, 36, 24, 73],
            'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boson']}

df = pd.DataFrame(raw_data)

**Column과 index number**를 입력한다.

In [29]:
df[['age', 'city']][:2]

   age           city
0   42  San Francisco
1   52      Baltimore

loc 인덱서를 이용해 **Column과 index name**을 입력한다.

In [31]:
df.loc[[1, 2], ["first_name", "last_name"]]

  first_name last_name
1      Molly  Jacobson
2       Tina       Ali

iloc 인덱서를 이용해 **Column number와 index number**를 입력한다.

In [33]:
df.iloc[:2, 1:3]

  last_name  age
0    Miller   42
1  Jacobson   52

<h4> data drop </h4>

**index number**로 하나의 행을 drop할 수 있다.

In [35]:
df.drop(1)

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73          Boson

**한 개 이상의 Index number**로 여러 행을 drop할 수 있다.

In [36]:
df.drop([1, 2, 3])

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
4        Amy     Cooze   73          Boson

**axis 매개변수를 1로 지정**해 column을 drop할 수 있다.

In [38]:
df.drop('age', axis=1)

  first_name last_name           city
0      Jason    Miller  San Francisco
1      Molly  Jacobson      Baltimore
2       Tina       Ali          Miami
3       Jake    Milner        Douglas
4        Amy     Cooze          Boson

<h3> operations </h3>

<h4> series operation </h4>

index를 기준으로 연산을 수행하며 겹치는 index가 없으면 NaN값을 반환한다.

In [40]:
s1 = pd.Series(range(1, 6), index=list("abced"))
s1

a    1
b    2
c    3
e    4
d    5
dtype: int64

In [41]:
s2 = pd.Series(range(5, 11), index=list("bcedef"))
s2

b     5
c     6
e     7
d     8
e     9
f    10
dtype: int64

In [42]:
s1.add(s2)

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

In [43]:
s1 + s2

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

<h4> dataframe operation </h4>

df는 **column과 index를 모두 고려**한다. add operation을 쓰면 NaN값을 0으로 변환할 수 있다. 

* **Operation type: add, sub, div, mul**

In [48]:
import numpy as np
df1 = pd.DataFrame(
    np.arange(9).reshape(3, 3),
    columns = list('abc')
)
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [50]:
df2 = pd.DataFrame(
    np.arange(16).reshape(4, 4),
    columns = list('abcd')
)
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [51]:
df1 + df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [52]:
df1.add(df2, fill_value=0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

In [53]:
df2.add(df1, fill_value=0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

<h4> series + dataframe </h4>

axis를 기준으로 row broadcasting을 실행한다.

In [54]:
df = pd.DataFrame(
    np.arange(16).reshape(4, 4),
    columns = list('abcd')
)
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [56]:
s2 = pd.Series(np.arange(10, 14))
s2

0    10
1    11
2    12
3    13
dtype: int64

In [57]:
# 그냥 덧셈을 하면 덧셈이 일어나지 않는다.
df + s2

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [58]:
# axis를 지정하면 broadcasting이 실행된다.
df.add(s2, axis=0)

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28

<h3> lambda, map, apply </h3>

<h4> map for series </h4>

pandas의 series type 데이터에도 **map함수**를 사용할 수 있다.

In [59]:
s1 = pd.Series(np.arange(10))
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [60]:
s1.map(lambda x: x**2).head(5)

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [61]:
# 기존 시리즈는 변환되지 않는다.
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int64

function 대신 **dict, sequence형 데이터로 대체**할 수 있다.

In [62]:
# dict type으로 데이터를 교체한다.
# 없는 값은 NaN으로 처리한다.
z = {1: 'A', 2: 'B', 3: 'C'}
s1.map(z).head(5)

0    NaN
1      A
2      B
3      C
4    NaN
dtype: object

In [63]:
# 같은 위치의 데이터를 s2로 전환한다.
s2 = pd.Series(np.arange(10, 20))
s1.map(s2).head(5)

0    10
1    11
2    12
3    13
4    14
dtype: int64

**replace 함수**는 map 함수의 기능중 데이터 변환 기능을 수행할 수 있다. <br> 데이터 변환시 많이 사용되는 함수다.

In [65]:
import pandas as pd
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
            'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
            'age': [42, 52, 36, 24, 73],
            'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boson'],
            'sex': ['male', 'female', 'male', 'female', 'male']}

df = pd.DataFrame(raw_data)
df

  first_name last_name  age           city     sex
0      Jason    Miller   42  San Francisco    male
1      Molly  Jacobson   52      Baltimore  female
2       Tina       Ali   36          Miami    male
3       Jake    Milner   24        Douglas  female
4        Amy     Cooze   73          Boson    male

In [66]:
df.replace({'male':0, "female":1}).head()

  first_name last_name  age           city  sex
0      Jason    Miller   42  San Francisco    0
1      Molly  Jacobson   52      Baltimore    1
2       Tina       Ali   36          Miami    0
3       Jake    Milner   24        Douglas    1
4        Amy     Cooze   73          Boson    0

<h4> apply for dataframe </h4>

map과 달리 series 전체(column)에 해당 함수를 적용할 수 있다.

In [67]:
!wget https://raw.githubusercontent.com/rstudio/Intro/master/data/wages.csv

--2021-11-08 13:11:39--  https://raw.githubusercontent.com/rstudio/Intro/master/data/wages.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.108.133, 185.199.109.133, 185.199.110.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.108.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 62250 (61K) [text/plain]
Saving to: ‘wages.csv’

wages.csv           100%[===================>]  60.79K  --.-KB/s    in 0.008s

2021-11-08 13:11:39 (7.14 MB/s) - ‘wages.csv’ saved [62250/62250]

In [70]:
df = pd.read_csv('wages.csv')
print(df.head(3))

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33

In [71]:
df_info = df[["earn", "height", "age"]]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [74]:
f = lambda x : x.max() - x.min()
df_info.apply(f)

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

mean, std 등 내장 연산 함수를 사용할 때도 똑같은 효과를 얻을 수 있다.

In [75]:
df_info.sum()

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [76]:
df_info.apply(sum)

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

scalar 값 이외에 **series값을 반환**할 수 있다.

In [79]:
def f(x):
  return pd.Series([x.min(), x.max()], index = ['min', 'max'])
df_info.apply(f)

              earn  height  age
min     -98.580489   57.34   22
max  317949.127955   77.21   95

<h4> applymap for dataframe </h4>
series 단위가 아닌 element 단위로 함수를 적용한다. <br>
series 단위에 apply를 적용시킬 때와 같은 효과를 가진다.

In [80]:
f = lambda x: -x
df_info.applymap(f).head(5)

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

In [81]:
df_info['earn'].apply(f).head(5)

0   -79571.299011
1   -96396.988643
2   -48710.666947
3   -80478.096153
4   -82089.345498
Name: earn, dtype: float64

<h3> pandas built-in functions </h3>

**describe 함수**는 데이터의 요약 정보를 보여준다.

In [82]:
df = pd.read_csv('wages.csv')
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [83]:
df.describe()

                earn       height           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640    13.354605    45.328499
std     31257.070006     3.818108     2.438741    15.789715
min       -98.580489    57.340000     3.000000    22.000000
25%     10538.790721    63.720000    12.000000    33.000000
50%     26877.870178    66.050000    13.000000    42.000000
75%     44506.215336    69.315000    15.000000    55.000000
max    317949.127955    77.210000    18.000000    95.000000

**unique 함수**는 series data의 유일한 값을 list로 반환한다.

In [84]:
# 유일한 인종의 값 list
df.race.unique()

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [85]:
np.array(dict(enumerate(df["race"].unique())))

array({0: 'white', 1: 'other', 2: 'hispanic', 3: 'black'}, dtype=object)

**sum 함수**는 기본적인 column 또는 row 값의 연산을 지원한다. <br>
이외에도 sub, mean, min, max, count, median, mad, var 등이 있다.

In [86]:
# column 별
df.sum(axis = 0)

earn                                            4.47434e+07
height                                              91831.2
sex       malefemalefemalefemalefemalefemalefemalemalema...
race      whitewhitewhiteotherwhitewhitewhitewhitehispan...
ed                                                    18416
age                                                   62508
dtype: object

In [87]:
# row 별
df.sum(axis = 1)

0       79710.189011
1       96541.218643
2       48823.436947
3       80652.316153
4       82212.425498
            ...
1374    30290.060363
1375    25018.829514
1376    13823.311312
1377    95563.664410
1378     9686.681857
Length: 1379, dtype: float64

**isnull 함수**로 column 또는 row 값의 NaN(null) 값의 index를 반환할 수 있다.

In [88]:
df.isnull()

       earn  height    sex   race     ed    age
0     False   False  False  False  False  False
1     False   False  False  False  False  False
2     False   False  False  False  False  False
3     False   False  False  False  False  False
4     False   False  False  False  False  False
...     ...     ...    ...    ...    ...    ...
1374  False   False  False  False  False  False
1375  False   False  False  False  False  False
1376  False   False  False  False  False  False
1377  False   False  False  False  False  False
1378  False   False  False  False  False  False

[1379 rows x 6 columns]

In [89]:
df.isnull().sum()

earn      0
height    0
sex       0
race      0
ed        0
age       0
dtype: int64

**sort_values 함수**를 이용해 column 값을 기준으로 데이터를 sort할 수 있다.

In [90]:
df.sort_values(["age", "earn"], ascending=True).head(10)

             earn  height     sex      race  ed  age
1038   -56.321979   67.81    male  hispanic  10   22
800    -27.876819   72.29    male     white  12   22
963    -25.655260   68.90    male     white  12   22
1105   988.565070   64.71  female     white  12   22
801   1000.221504   64.09  female     white  12   22
862   1002.023843   66.59  female     white  12   22
933   1007.994941   68.26  female     white  12   22
988   1578.542814   64.53    male     white  12   22
522   1955.168187   69.87  female     black  12   22
765   2581.870402   64.79  female     white  12   22

**corr, cov, corrwith 함수**를 이용해 상관계수와 공분산을 구할 수 있다.

In [91]:
df.age.corr(df.earn) # 상관계수

0.07400349177836055

In [92]:
df.age.cov(df.earn) # 공분산

36523.6992104089

In [93]:
df.corrwith(df.earn)

earn      1.000000
height    0.291600
ed        0.350374
age       0.074003
dtype: float64

In [94]:
df.corr()

            earn    height        ed       age
earn    1.000000  0.291600  0.350374  0.074003
height  0.291600  1.000000  0.114047 -0.133727
ed      0.350374  0.114047  1.000000 -0.129802
age     0.074003 -0.133727 -0.129802  1.000000